<!-- ***** BEGIN LICENSE BLOCK *****
   - Version: MPL 1.1/GPL 2.0/LGPL 2.1
   -
   - The contents of this file are subject to the Mozilla Public License Version
   - 1.1 (the "License"); you may not use this file except in compliance with
   - the License. You may obtain a copy of the License at
   - http://www.mozilla.org/MPL/
   -
   - Software distributed under the License is distributed on an "AS IS" basis,
   - WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
   - for the specific language governing rights and limitations under the
   - License.
   -
   - The Original Code is mozilla.org code.
   -
   - The Initial Developer of the Original Code is
   - the Mozilla Organization
   - Portions created by the Initial Developer are Copyright (C) 1998-2003
   - the Initial Developer. All Rights Reserved.
   -
   - Contributor(s):
   -   Robert Kaiser <KaiRo@KaiRo.at>
   -   Alexander Ihrig <Thunder@diepause.de>
   -
   - Alternatively, the contents of this file may be used under the terms of
   - either the GNU General Public License Version 2 or later (the "GPL"), or
   - the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
   - in which case the provisions of the GPL or the LGPL are applicable instead
   - of those above. If you wish to allow use of your version of this file only
   - under the terms of either the GPL or the LGPL, and not to allow others to
   - use your version of this file under the terms of the MPL, indicate your
   - decision by deleting the provisions above and replace them with the notice
   - and other provisions required by the LGPL or the GPL. If you do not delete
   - the provisions above, a recipient may use your version of this file under
   - the terms of any one of the MPL, the GPL or the LGPL.
   -
   - ***** END LICENSE BLOCK ***** -->
#Translated with MozillaTranslator version 5.02
#Thu Sep 04 12:29:44 CEST 2003
turnOffHtml=Sie haben HTML f\u00FCr dieses Konto aktiviert. Wenn Sie Nachrichten nach dem Inline-PGP-Standard versenden wollen, dann sollten Sie HTML deaktivieren, da verschl\u00FCsselte/unterschriebene HTML-Nachrichten nicht korrekt \u00FCberpr\u00FCft werden k\u00F6nnen.\n\nWollen Sie HTML f\u00FCr dieses Konto deaktivieren?
prefGood=Korrekte Unterschrift von %S
failFingerprint=Fehler - Extraktion des Fingerabdrucks fehlgeschlagen
successKeyImport=Die Schl\u00FCssel wurden erfolgreich importiert
noPassphrase=Fehler - kein Mantra angegeben
decryptOkNoSig=Achtung  Die Entschl\u00FCsselung war erfolgreich, aber die Unterschrift konnte nicht \u00DCberpr\u00FCft werden.
noMessage=Keine Nachricht zum speichern vorhanden\!
incompleteDecrypt=Entschl\u00FCsselung unvollst\u00E4ndig
unverifiedSig=Unterschrift nicht verifiziert
specifyEmail=Geben Sie bitte Ihre Haupt-Email-Adresse an, die benutzt wird, um den Unterschrift-Schl\u00FCssel f\u00FCr ausgehende Nachrichten auszuw\u00E4hlen.  Wenn Sie keine Adresse angeben wird die Email-Adresse im FROM-Feld benutzt.  HINWEIS\: Enigmail erlaubt seit Version 0.60 aufgrund von Mehrdeutigkeiten nicht mehr die Option `Vorgabe-Schl\u00FCssel`.
enigError=Enigmail Fehler
failedSig=Fehler - \u00DCberpr\u00FCfung der Unterschrift fehlgeschlagen
notRequired=Fehler - keine Verschl\u00FCsselung notwendig
passCheckBox=Setzen Sie bitte die entsprechende Option, wenn Sie kein Mantra f\u00FCr den Schl\u00FCssel benutzen.
needKey=Fehler - geheimer Schl\u00FCssel wird zur Entschl\u00FCsselung ben\u00F6tigt
passUserName=Geben Sie bitte den Benutzer-Namen f\u00FCr diese Identit\u00E4t an.
usingAgent=Benutze %S Executable %S zur Ver- und Entschl\u00FCsselung
navDecryptError=Fehler beim Entschl\u00FCsseln der Nachricht. 
signFailed=Fehler in Enigmail; Verschl\u00FCsselung bzw. Unterschreiben fehlgeschlagen; Nachricht ungesichert senden?
enigContentNote=Enigmail\: *Anh\u00E4nge an diese Nachricht wurden nicht unterschrieben oder verschl\u00FCsselt*\r \r 
keyConfirm=Erzeuge \u00D6ffentlichen und geheimen Schl\u00FCssel f\u00FCr '%S'?
acctNotConfigured=Sie haben f\u00FCr dieses Konto nicht eingestellt, OpenPGP (Enigmail) zu benutzen.\nUnverschl\u00FCsselte Nachricht versenden?
enigConfirm=Enigmail Best\u00E4tigung
dlgNo=Nein
configNow=Wollen Sie Enigmail Version %s jetzt konfigurieren? 
navEncryptError=Fehler beim Verschl\u00FCsseln und/oder Unterschreiben der Nachricht. 
noPGPblock=Fehler - kein g\u00FCltiger PGP-Block gefunden
passNoMatch=Mantra passt nicht; wiederholen Sie bitte die Eingabe.
turnOffFlowed=Die Mozilla Option 'Flowed text zulassen (RFC 2646)' ist standardm\u00E4ssig aktiviert. Leider kann dies zu Problemen beim Verifizieren von Klartext Nachrichten f\u00FChren. Es wird daher empfohlen, diese Option auszuschalten.  Soll Enigmail die Option 'Flowed text zulassen (RFC 2646)' jetzt ausschalten?
extraText=Extra Text vor dem PGP-Block. Dr\u00FCcken Sie den Entschl\u00FCsselungs-Knopf
notFirstBlock=Fehler - Der erste PGP-Block ist kein \u00F6ffentlicher Schl\u00FCssel-Block
cantImport=Fehler beim Import eines \u00F6ffentlichen Schl\u00FCssels  
testNoEmail=EnigTest\: Geben Sie bitte eine Email-Adresse zum Testen an
clickDecryptRetry=; dr\u00FCcken Sie bitte den Entschl\u00FCsselungs-Knopf f\u00FCr einen erneuten Versuch
selKeyExpired=abgelaufen %S
saveAttachmentHeader=Enigmail\: Entschl\u00FCsselte Anlage speichern
notePartEncrypted=Enigmail\: *Teile der Nachtricht sind NICHT unterschrieben oder verschl\u00FCsselt*
enigAlert=Enigmail Warnung
prefUntrusted=UNVERTRAUT
onlineSend=%S Nachricht an %S schicken?
useButton=Dr\u00FCcken Sie bitte den Enschl\u00FCsseln-Knopf, um die Nachricht zu entschl\u00FCsseln
sendingNews=Das Senden der verschl\u00FCsselten Nachricht wurde abgebrochen.  Diese Nachricht kann nicht verschl\u00FCsselt werden, da unter den Empf\u00E4ngern Newsgroup-Adressen sind. Senden Sie bitte diese Nachricht ohne Verschl\u00FCsselung.
sigMismatch=Fehler - Unterschrift nicht korrekt
failNoKey=Fehler - Kein Schl\u00FCssel gefunden f\u00FCr %S
noPGPMIME=PGP/MIME nicht verf\u00FCgbar\! Inline-PGP f\u00FCr Unterschrift bzw. Verschl\u00FCsselung benutzen?
repeatPrefix=\n\nDiese Nachricht wird %s wiederholt.
reloadImapError=Fehler - IMAP-Nachricht ist zu gross f\u00FCr die Entschl\u00FCsselung bzw. Verifikation
sendingBCC=Diese Nachricht hat Empf\u00E4nger im BCC-Feld (blind copy, versteckt). Wenn diese Nachricht verschl\u00FCsselt wird, k\u00F6nnen alle Empf\u00E4nger die versteckten Empf\u00E4nger herausfinden, indem sie die Liste der Schl\u00FCssel, mit der diese Nachricht verschl\u00FCsselt wurde, auswerten was damit zu einem Vertraulichkeitsverlust f\u00FChrt.   Dr\u00FCcken Sie den OK-Knopf, um dennoch fortzufahren, oder den Abbrechen-Knopf, um das Absenden abzubrechen.
clickQueryPenDetails=; dr\u00FCcken Sie bitte auf das Zeichen mit dem Stift f\u00FCr Einzelheiten
genComplete=Schl\u00FCssel-Erzeugung abgeschlossen\! Die Identit\u00E4t <%S> wird zum Unterschreiben benutzt
first=erste
securityInfo=OpenPGP Sicherheits-Information\n\n
invalidEmail=Fehler - ung\u00FCltige Email-Adresse(n)
clickKeyDetails=; dr\u00FCcken Sie bitte auf das Zeichen mit dem zerbrochenen Schl\u00FCssel f\u00FCr Einzelheiten
uninstallSuccess=Enigmail entfernt.
statEncrypted=VERSCHL\u00DCSSELTE
windowLocked=Das Editorfenster ist blockiert; Das Senden wurde abgebrochen
failedDecryptVerify=Fehler - Entschl\u00FCsselung/Verifikation fehlgeschlagen
failNoID=Fehler - Es wurde keine Schl\u00FCssel-ID angegeben
keyImportError=Kann den \u00F6ffentlichen Schl\u00FCssel nicht entgegennehmen  
versionWarning=Warnung\: Inkompatible EnigMime Version %S
repeatSuffixSingular=einmal
importKey=Importiere \u00F6ffentlichen Schl\u00FCssel %S vom Schl\u00FCssel-Server\:
pubKey=\u00D6ffentlicher Schl\u00FCssel f\u00FCr %S 
createdHeader=Erstellt
statSigned=UNTERSCHRIEBENE
encryptKeyHeader=PGP Schl\u00FCssel f\u00FCr Verschl\u00FCsselung w\u00E4hlen
testNoSvc=EnigTest\: Zugriff auf Enigmail-Dienste fehlgeschlagen
notInit=Fehler - Enigmail-Dienste noch nicht eingerichtet
repeatSuffixPlural=mehrmals
clickPen=; dr\u00FCcken Sie bitte auf das Zeichen mit dem Stift und Fragezeichen
genGoing=Schl\u00FCssel-Erzeugung l\u00E4uft\!
noTempDir=Konnte kein tempor\u00E4res Verzeichnis zum schreiben finden. Bitte setzen Sie die TEMP Umgebungsvariable.
cmdLine=Kommandozeile und Ausgabe\:
dlgNever=Nicht mehr fragen
clickPenDetails=; dr\u00FCcken Sie bitte auf das Zeichen mit dem zerbrochenen Stift f\u00FCr Einzelheiten
sendAborted=Das Senden wurde abgebrochen.\n\n
recipientsSelectionHdr=Empf\u00E4nger f\u00FCr Verschl\u00FCsselung w\u00E4hlen
usingFrom=Die Adresse im FROM-Feld wird benutzt, um den Unterschrift-Schl\u00FCssel f\u00FCr ausgehende Nachrichten zu ermitteln.
endPgpPart=******** *ENDE VERSCHL\u00DCSSELTE oder UNTERSCHRIEBENE NACHRICHT* ********
pgpMimeNote=HINWEIS\: PGP/MIME wird nur von einer beschr\u00E4nkten Zahl von Email Anwendungen unterst\u00FCtzt\! Auf Windows sind nur Enigmail, Sylpheed, Pegasus und Mulberry daf\u00FCr bekannt, diesen Standard zu unterst\u00FCtzen; auf Linux/UNIX und Mac OS X wird er von den meisten popul\u00E4ren Email Anwendungen unterst\u00FCtzt. Wenn sie nicht sicher sind, was zu tun, w\u00E4hlen Sie die %S Option.
pgpNotSupported=Sie scheinen Enigmail zusammen mit PGP 6.x zu verwenden. Leider weist PGP 6.x einige Probleme auf, die verhindern, dass Enigmail korrekt funktioniert. Darum unterst\u00FCtzt Enigmail PGP 6.x nicht mehr. Bitte verwenden Sie deshalb in Zukunft GnuPG (GPG).  Falls sie f\u00FCr den Wechel auf GPG Unterst\u00FCtzung brauchen, besuchen Sie die Seite "Help" auf der Enigmail Homepage.
sendUnencrypted=Initialisierung von Enigmail fehlgeschlagen. Nachricht unverschl\u00FCsselt abschicken?
genCompleteNoSign=Schl\u00FCssel-Erzeugung abgeschlossen\!
attachmentPgpKey=Die Anlage '%S' scheint PGP-Schl\u00FCssel zu enthalten.  Klicken Sie OK, um die Schl\u00FCssel zu importieren, oder Abbruch um die Datei in einem Browser-Fenster zu \u00F6ffnen.
rememberPass=Erst nach %S Minuten Unt\u00E4tigkeit vergessen
enterPass=Geben Sie bitte Ihr %S Mantra ein
hasHTML=Warnung vor HTML-Nachricht\: \nDiese Nachricht kann HTML enthalten. Das kann das korrekte Unterschreiben bzw. Verschl\u00FCsseln dieser Nachricht verhindern. Um dies zuk\u00FCnftig beim Versenden unterschriebener Nachrichten zu vermeiden, dr\u00FCcken Sie bitte die SHIFT-Taste gleichzeitig mit dem Erstellen- bzw. Antworten-Knopf. Wenn Sie Nachrichten nach Vorgabe unterschreiben, entfernen Sie bitte den Haken in den Einstellungen 'Nachrichten als HTML erstellen', um den Versand von HTML-Nachrichten dauerhaft zu verhindern.
configEnigmail=Enigmail konfigurieren?
keyNeeded=\u00D6ffentlicher Schl\u00FCssel %S zur \u00DCberpr\u00FCfung der Unterschrift ben\u00F6tigt
uninstallFailOverlay=Entfernen der 'Enigmail communicator overlay RDF' fehlgeschlagen; entferne nicht die jar-Datei in chrome
decryptedMsg=Entschl\u00FCsselte Nachricht
prefExpired=ABGELAUFEN
prefRevoked=WIDERRUFEN
failNoServer=Fehler - Es wurde kein Schl\u00FCssel-Server angegeben
usingId=Die Benutzer-ID %S wird benutzt, um den Unterschrift-Schl\u00FCssel f\u00FCr ausgehende Nachrichten zu ermitteln.
offlineNote=Sie sind momentan offline. Soll die Nachricht im Ordner 'Ungesendete Nachrichten' gespeichert werden?
keysToExport=Benutzer-ID (Email-Adressen) von zu exportierenden Schl\u00FCsseln
usingVersion=Benutze Enigmail Version %S
enigNote=Mitteilung von Enigmail\: Anh\u00E4nge an dieser Nachricht wurden nicht unterschrieben oder verschl\u00FCsselt.
composeSpecifyEmail=Geben Sie bitte eine Haupt-Emailadresse an, die benutzt wird, um den Unterschrift-Schl\u00FCssel f\u00FCr ausgehende Nachrichten auszuw\u00E4hlen. Wenn Sie keine Adresse angeben, wird die Emailadresse im FROM-Feld der Nachricht zur Auswahl des Schl\u00FCssels benutzt.
contAnyway=M\u00F6chten Sie trotzdem fortfahren?
failedDecrypt=Fehler - Entschl\u00FCsselung fehlgeschlagen
importKeyConfirm=In der Nachricht enthaltenen \u00F6ffentlichen Schl\u00FCssel importieren?
savingMessage=Wollen Sie die Nachricht vor dem Speichern verschl\u00FCsseln?\n\nOK w\u00E4hlen, um Verschl\u00FCsselung zu aktivieren oder ABBRECHEN, um die Nachricht unverschl\u00FCsselt zu speichern.
statPlain=UNGESICHERTE
offlineSave=%S Nachricht an %S im Ordner 'Ungesendete Nachrichten' speichern?
failOnlyGPG=Fehler - Nur GPG kann Schl\u00FCssel vom Schl\u00FCssel-Server holen
failKeyImport=Fehler - Schl\u00FCssel konnte nicht importiert werden
toVerify=um die Unterschrift zu \u00FCberpr\u00FCfen.
attachWarning=Anlagen zu dieser Nachicht sind nicht lokal, sie k\u00F6nnen nicht verschl\u00FCsselt werden. Um die Anlagen zu verschl\u00FCssel, speichern Sie diese zuerst als lokale und f\u00FCgen sie sie anschliessend bei. M\u00F6chten sie trotzdem weiterfahren?
enigPrompt=Enigmail Eingabe
noLogDir=Tragen Sie bitte in den Einstellungen 'Log-Verzeichnis' ein Verzeichnis ein, um das Log-File zu erstellen
noLogFile=Das Log-File wurde noch nicht erstellt\!
Enigmail=Enigmail
prefBad=FALSCHE Unterschrift von %S
onlyGPG=Schl\u00FCssel-Erzeugung funktioniert nur mit GnuPG (nicht mit PGP)\!
failKeyExtract=Fehler - Schl\u00FCssel-Extraktion fehlgeschlagen
beginPgpPart=******* *BEGINN VERSCHL\u00DCSSELTE oder UNTERSCHRIEBENE NACHRICHT* *******
strippingHTML=Die Nachricht enth\u00E4lt HTML-Formatierungen, die verloren gehen, wenn die Nachricht f\u00FCr die Unterschrift bzw. Verschl\u00FCsselung in ein Nur-Text-Format umgewandelt wird. Wollen Sie fortfahren?
failCancel=Fehler - Schl\u00FCssel-Empfang durch Benutzer abgebrochen
decryptToImport=Dr\u00FCcken Sie den Entschl\u00FCsselungs-Knopf, um den \u00F6ffentlichen Schl\u00FCssel-Block aus der Nachricht zu importieren.
noDecrypted=Keine entschl\u00FCsselte Nachricht zum Speichern gefunden\! Benutzen Sie Speichern im Datei-Men\u00FC
uninstallConfirm=Wollen Sie alle Enigmail betreffenden Dateien aus den
notComplete=Fehler - Schl\u00FCssel-Erzeugung noch nicht abgeschlossen
dlgYes=Ja
uninstallFail=Konnte Enigmail nicht entfernen
clickDecrypt=; dr\u00FCcken Sie bitte den Entschl\u00FCsselungs-Knopf
badCommand=Fehler - Verschl\u00FCsselung fehlgeschlagen
keyImport=\n\nDr\u00FCcken Sie den OK-Knopf, um den \u00F6ffentlichen Schl\u00FCssel %S vom Schl\u00FCssel-Server zu importieren.
viewInfo=; Ansicht > Nachrichtensicherheitsinformation f\u00FCr Details
enigHeader=Enigmail\:
reloadImapMessage=Komplette IMAP-Nachricht neuladen f\u00FCr die Entschl\u00FCsselung bzw. Verifikation?
sendingPGPMIME=Anh\u00E4nge an diese Nachricht werden nur dann unterschrieben bzw. verschl\u00FCsselt, wenn das PGP/MIME-Format verwendet wird. PGP/MIME wird aber nicht von allen E-Mailprogrammen unterst\u00FCtzt. Enigmail, Evolution und Mutt unterst\u00FCtzen das Format.  Dr\u00FCcken Sie bitte auf den OK-Knopf, um das PGP/MIME-Format f\u00FCr diese Nachricht zu benutzetn, den Abbrechen-Knopf f\u00FCr Inline-PGP.
agentError=FEHLER\: Zugriff auf Enigmail-Dienste fehlgeschlagen\!
uninstallFailDelete=Fehler beim L\u00F6schen der Datei
badPhrase=Fehler - falsches Mantra
noRepeat=\n\nDiese Meldung wird bis zu einem Upgrade von Enigmail nicht wiederholt.
keyAbort=Schl\u00FCssel-Erzeugung abbrechen?
accessError=Fehler beim Zugriff auf Enigmail-Dienste
second=zweite
keyId=Schl\u00FCssel 
saveHeader=Enigmail\: Speichere entschl\u00FCsselte Nachricht
restartForLog=Starten Sie bitte Mozilla neu, um das Log-File zu erstellen
enigmimeWarning=Warnung\: EnigMime Modul nicht verf\u00FCgbar
statPGPMIME=PGP/MIME
prefExpiredKey=ABGELAUFENER SCHL\u00DCSSEL
failMultiple=Fehler - Mehrere Schl\u00FCssel gefunden f\u00FCr %S
clickKey=; dr\u00FCcken Sie bitte auf das Zeichen mit dem zerbrochenen Schl\u00FCssel
