<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/st
rict.dtd">
<html>
<head>
</head>
<body>
<h1>Upgrade-Information f&uuml;r Enigmail ab Version 0.8x</h1>

<p>Enigmail ab Version 0.8x f&uuml;r Thunderbird hat eine neue Benutzeroberfl&auml;che erhalten! <b>Wenn Sie bisher schon mit Enigmail Versionen vor 0.81.0 vertraut waren, dann lesen Sie diese Information bevor Sie fortfahren</b>.
</p>
<h2>Enigmail konfigurieren</h2>
<p>Enigmails Konfiguration ist nun zweigeteilt:</p>
<ul>
<li>Kontenabh&auml;ngige Einstellungen f&uuml;r die OpenPGP-Schl&uuml;ssel-ID, Standards zu Verschl&uuml;sselung &amp; Authentifizierung</li>
<li>Allgemeine Einstellungen
</li>
</ul>
<h3>Kontenabh&auml;ngige Einstellungen</h3>
<p>Die kontenabh&auml;ngigen Einstellungen sind &uuml;ber das Men&uuml; <em>Extras &gt; Konten...</em> erreichbar. F&uuml;r jedes Konto ist dort ein Listeneintrag &quot;<em>OpenPGP-Sicherheit</em>&quot; vorhanden, der die kontenabh&auml;ngigen Einstellungen beherbergt.</p>
<p>Die OpenPGP-Schl&uuml;sseleinstellungen von Enigmail v0.80.0 und &auml;lter werden 
<b>nicht</b> &uuml;bernommen f&uuml;r die neuen kontenabh&auml;ngigen Einstellungen. Enigmail ist standardm&auml;&szlig;ig <b>deaktiviert</b> f&uuml;r alle Konten!</p>
<h3>Allgemeine Einstellungen</h3>
<p>Die allgemeinen Einstellungen wurden bereinigt und in einen Dialog zusammen gefasst. Die Einstellungen sind &uuml;ber das Men&uuml; &quot;Enigmail&quot; und &uuml;ber die Schaltfl&auml;che &quot;<em>Erweitert...</em>&quot; in den Konteneinstellungen &gt; OpenPGP-Sicherheit erreichbar.</p>
<p>Eine neue Option wurde hinzugef&uuml;gt, die eine automatische Verschl&uuml;sselung bei Antworten auf verschl&uuml;sselte Nachrichten erm&ouml;glicht. Beachten Sie, dass davon die Einstellungen f&uuml;r das Unterschreiben von Nachrichten nicht betroffen sind.</p>
<h2>Nachrichten verfassen</h2>
<p>Das Verhalten von Enigmail wurde angepasst, sodass es eher dem Verhalten bei S/MIME entspricht. Eine neue Schaltfl&auml;che &quot;OpenPGP&quot; wurde hinzugef&uuml;gt, &uuml;ber die man die Verschl&uuml;sselungs-/Unterschriften-Einstellungen ausw&auml;hlen kann. Das Men&uuml; &quot;Enigmail&quot; bietet nun nicht mehr die M&ouml;glichkeit zum Senden von verschl&uuml;sselten/unterschriebenen Nachrichten - dies geschieht nun &uuml;ber die normale Schaltfl&auml;che &quot;<em>Senden</em>&quot; oder &uuml;ber das Men&uuml; &quot;<em>Datei</em>&quot;<em> &gt; </em>&quot;<em>Senden</em>&quot;<em>.</em>
<b> Es empfiehlt sich, dass Sie Ihre neuen Einstellungen testen, indem Sie sich eine Reihe von Nachrichten selbst senden, bevor Sie Enigmail aktiv 
nutzen. Dadurch werden Sie das neuen Verhalten besser verstehen.</b>
</p>
<p>Die Einstellungen f&uuml;r Verschl&uuml;sselung und Unterschreiben von Nachrichten sind nun sichtbar in der unteren rechten Ecke des Fensters &quot;Verfassen&quot;. Kleine Symbole zeigen, ob Unterschreiben oder Verschl&uuml;sselung aktiviert sind.</p>

<h2>Bekannte Probleme</h2>

<ul>
<li>Enigmail ist bisher nicht in der Lage, sich mehrere Passphrasen f&uuml;r unterschiedliche OpenPGP-Schl&uuml;ssel zu merken. Entweder geben Sie die Passphrasen jedesmal neu ein, oder Sie vergeben f&uuml;r alle Schl&uuml;ssel die gleiche Passphrase.</li>
</ul>
</body>
</html>
