<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/st
rict.dtd">
<html>
<head>
</head>
<body>
<h1>Informaci&oacute;n de actualizaci&oacute;n para Enigmail 0.8x</h1>

<p>Enigmail v0.8x para Thunderbird ten unha nova interface de usuario!
<b>Se est&aacute; familiarizado/a con versi&oacute;ns de Enigmail anteriores a 0.81.0, 
lea esta informaci&oacute;n antes de continuar</b>.
</p>
<h2>Configurar Enigmail</h2>
<p>A configuraci&oacute;n de Enigmail est&aacute; dividida en d&uacute;as partes:</p>
<ul>
<li>Configuraci&oacute;n espec&iacute;fica da conta para a o ID da chave PGP, cifrado/sinatura predefinidos
</li>
<li>Preferencias globais com&uacute;ns
</li>
</ul>
<h3>Configuraci&oacute;ns espec&iacute;ficas das contas</h3>
<p>As configuraci&oacute;ns espec&iacute;ficas da conta est&aacute;n dispo&ntilde;&iacute;beis a trav&eacute;s do men&uacute; <em>Ferramentas
-&gt; Configuraci&oacute;n das contas</em>. Para cada conta hai un elemento da lista
<em>Seguridade OpenPGP</em> que manexa as opci&oacute;ns espec&iacute;ficas para cada conta.
</p>
<p>A configuraci&oacute;n da chave PGP desde Enigmail v0.80.0 e versi&oacute;ns anteriores
<b>non</b> se convertiu nunha configuraci&oacute;n nova por conta.
Enigmail foi <b>desactivado</b> de forma predefinida para todas as contas!
</p>
<h3>Preferencias Globais Com&uacute;ns</h3>
<p>As configuraci&oacute;ns globais com&uacute;nas foron limpadas e mezcladas nunha soa xanela.
As preferencias tam&eacute;n est&aacute;n dispo&ntilde;&iacute;beis a trav&eacute;s do men&uacute; de Enigmail, ou facendo clic
no bot&oacute;n <em>Avanzada</em> nas preferencias de seguridade OpenPGP do xestor de contas.
</p>
<p>Engadiuse unha nova opci&oacute;n que lle permite activar o cifrado automaticamente ao
responder a unha mensaxe cifrada. Te&ntilde;a en conta que isto non infl&uacute;e na configuraci&oacute;n 
da sinatura da mensaxe.
</p>
<h2>Composici&oacute;n de mensaxes</h2>
<p>O comportamendo de Enigmail foi adaptado para ser semellante
ao comportamento de S/MIME. Engadiuse un novo bot&oacute;n OpenPGP
desde onde se pode seleccionar a configuraci&oacute; de cifrado / sinatura.
O men&uacute; de Enigmail non sirve para enviar correos cifrados ou
asinados, o env&iacute;o faise unicamente desde o bot&oacute;n normal de 
<em>Enviar</em> ou desde o men&uacute; Ficheiro -&gt; Enviar. <b>&Eacute; suxer&iacute;bel
que experimente a nova configuraci&oacute;n enviandose un par de correos a si
mesmo antes de utilizalo con normalidade</b>, para que poida comprender
o novo comportamento.
</p>
<p>A configuraci&oacute;n para o cifrado e sinatura dunha mensaxe est&aacute; agora
vis&iacute;bel na esquina inferior dereita da xanela de composici&oacute;n de mensaxes,
con pequenas iconas que se mostran se a sinatura ou o cifrado est&aacute;n activados.
</p>

<h2>Problemas co&ntilde;ecidos</h2>

<ul>
<li>Enigmail a&iacute;nda non pode lembrar varios contrasinais para chaves PGP 
diferentes. Utilice o mesmo contrasinal para todas as chaves que utiliza ou 
introduza o contrasinal cada vez que o precise.
</li>
</ul>
</body>
</html>
