<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Enigmail-Hilfe: Enigmail-Empf&auml;gerregeln</title>
  <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
  <style type="text/css" xml:space="preserve">
  /*<![CDATA[*/
    dt  { font-weight: bold;  }
  /*]]>*/
  </style>
</head>

<body>
	<h1>Enigmail-Hilfe</h1>

	<h3>Enigmail-Empf&auml;ngerregeln</h3>

	<p>Mit dem Regel-Editor kann man Standards in Bezug auf Verschl&uuml;sselung, Unterschreiben und PGP/MIME f&uuml;r bestimmte Empf&auml;nger und die Benutzung von Schl&uuml;sseln einstellen. Jede Regel besteht aus 5 Feldern und ist in einer einzelnen Zeile zu finden:</p>

	<dl>
	  <dt>E-Mail-Adresse</dt>

	  <dd>Die E-Mail-Adressen der Felder &quot;An:&quot;, &quot;CC:&quot; und &quot;BCC:&quot;, die &uuml;bereinstimmen sollen. Die &Uuml;bereinstimmung arbeitet mit <span style="font-style: italic;">substrings</span> (Weitere Details im Dialog &quot;Enigmail-Empf&auml;ngerregel bearbeiten&quot;).</dd>

	  <dt>OpenPGP-Schl&uuml;ssel</dt>

	  <dd>Eine Liste der OpenPGP-Schl&uuml;ssel-IDs, die f&uuml;r den Empf&auml;nger verwendet werden sollen.</dd>

	  <dt>Unterschreiben</dt>

	  <dd>
	  	Unterschreiben von Nachrichten erm&ouml;glichen / nicht erm&ouml;glichen. Dies verwendet die Einstellungen, die im Fenster &quot;Verfassen&quot; angegeben sind oder setzt sich dar&uuml;ber hinweg. Es gibt folgende Optionen:

		  <ul>
		    <li><em>Nie</em>: Unterschreiben unm&ouml;glich, selbst wenn im Fenster &quot;Verfassen&quot; angegeben (setzt sich &uuml;ber andere Einstellungen hinweg).</li>

		    <li><em>Ja, wenn beim Verfassen ausgew&auml;hlt</em>: Einstellung aus dem Fenster &quot;Verfassen&quot; wird &uuml;bernommen.</li>

		    <li><em>Immer</em>: Unterschreiben, selbst wenn <span style="font-style: italic;">nicht</span> im Fenster &quot;Verfassen&quot; angegeben.</li>
		  </ul>

			<p>Diese Unterschriftseinstellungen werden auf alle Regeln angewendet, die &uuml;bereinstimmen. Wenn eine der Regeln das Unterschreiben unm&ouml;glich macht, dann wird die Nachricht nicht unterschrieben - auch wenn bei anderen Regeln <i>Immer</i> angegeben ist.</p>
		</dd>

		<dt>Verschl&uuml;sseln</dt>

		<dd>Verschl&uuml;sselung erm&ouml;glichen / nicht erm&ouml;glichen. Die m&ouml;glichen Einstellungen und ihre Bedeutungen stimmen mit den oben genannten &uuml;berein.</dd>

		<dt>PGP/MIME</dt>

		<dd>Verwenden von PGP/MIME (RFC 3156) erm&ouml;glichen / nicht erm&ouml;glichen. Falls PGP/MIME nicht m&ouml;glich ist, dann werden die Nachrichten per &quot;Inline PGP&quot; verschl&uuml;sselt. Die m&ouml;glichen Einstellungen und ihre Bedeutungen stimmen mit den oben genannten &uuml;berein.</dd>
	</dl>

	<p>Die Regeln werden in der Reihenfolge, wie sie in der Liste erscheinen, angewendet. Wann immer eine Regel auf einen Empf&auml;nger zutrifft und eine OpenPGP-Schl&uuml;ssel-ID enth&auml;lt, dann wird der Empf&auml;nger nach Verwendung der angegeben Schl&uuml;ssel-ID bei den nachfolgenden Regeln nicht mehr beachtet.</p>

	<p><em>Hinweis:</em> Der Regel-Editor ist noch nicht komplett. Es ist m&ouml;glich, weiter fortgeschrittene Regeln zu schreiben, indem man direkt die Regel-Datei bearbeitet (diese Regeln sollten danach nicht mehr mit dem Regel-Editor bearbeitet werden). <a href="https://www.enigmail.net/documentation/pgprules_file.php" target="_blank">Weitere Informationen</a>, wie die Datei bearbeitet werden muss, gibt es auf der Enigmail-Homepage</p>
	<hr/>

	<p>Weitere Hilfe ist verf&uuml;gbar auf der <a href="https://www.enigmail.net/support/" target="_blank">Enigmail-Hilfeseite</a></p>
</body>
</html>
