<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/st
rict.dtd">
<html>
<head>
</head>
<body>
<h1>Informaci&oacute;n de actualizaci&oacute;n para Enigmail 0.8x</h1>

<p>&iexcl;Enigmail v0.8x para Thunderbird ha recibido una nueva interfaz de usuario!
<b>Si est&aacute; familiarizado con versiones de Enigmail anteriores a la 0.81.0, por favor,
lea esta informaci&oacute;n antes de proceder</b>.
</p>
<h2>Configurar Enigmail</h2>
<p>La configuaci&oacute;n de Enigmail ahora est&aacute; separada en dos partes:</p>
<ul>
<li>Opciones espec&iacute;ficas de la cuenta para el ID de la clave PGP, cifrado
/ firmado predeterminados
</li>
<li>Preferencias globales comunes
</li>
</ul>
<h3>Opciones espec&iacute;ficas de la cuenta</h3>
<p>Las opciones espec&iacute;ficas de la cuenta est&aacute;n disponibles a trav&eacute;s
del men&uacute;<em>Herramientas
-&gt; Configuraci&oacute;n de la cuenta</em>. Para cada cuenta ahora hay una lista de
elementos de <em>Seguridad OpenPGP</em> que mantiene las opciones espec&iacute;ficas
para cada cuenta.
</p>
<p>La configuraci&oacute;n de la clave PGP desde Enigmail v0.80.0 y versiones anteriores <b>no</b> est&aacute;n convertidas a la nueva configuraci&oacute;n por cuenta.
&iexcl;Enigmail est&aacute;&nbsp;&nbsp; <b>desactivado</b>  por defecto para todas las cuentas!
</p>
<h3>Preferencias globales comunes</h3>
<p>La configuraci&oacute;n global comun se ha reconstruido y ahora
est&aacute; en un &uacute;nico cuadro de di&aacute;logo Las
preferencias est&aacute;n disponibles a trav&eacute;s del men&uacute;
de Enigmail o pulsando el bot&oacute;n <em>Avanzadas</em> desde la configuraci&oacute;n de la cuenta en el cliente, y luego Seguridad OpenPGP.
</p>
<p>Se ha a&ntilde;adido una nueva opci&oacute;n que puede activar el
cifrado autom&aacute;ticamente si se responde a un mensaje cifrad. Hay
que tener en cuenta que esto no influye en la configuraci&oacute;n de
firma de mensajes.
</p>
<h2>Redacci&oacute;n de mensajes</h2>
<p>El comportamiento de Enigmail se ha adaptado para que sea similar al
de S/MIME. Se ha a&ntilde;adido un bot&oacute;n nuevo OpenPGP desde
donde se puede seleccionar la configuraci&oacute;n para cifrar o
firmar. El men&uacute; Enigmail ya no sirve para enviar correo cifrado
o firmado, ya que esto se hace &uacute;nicamente desde el bot&oacute;n
normal de <em>Enviar</em> o el men&uacute; Archivo -&gt; Enviar <b>Se recomienda que se prueben las opciones nuevas mandando un par de mensajes a uno mismo antes de usarlo activamente</b>, para comprender el nuevo comportamiento.
</p>
<p>Las opciones para cifrar o firmar un mensaje est&aacute;n ahora
visibles en la esquina inferior derecha de la ventana de
redacci&oacute;n de mensajes, con iconos peque&ntilde;os que se
muestran si firmar o cifrar est&aacute; activado.
</p>

<h2>Problemas conocidos</h2>

<ul>
<li>Enigmail todav&iacute;a no es capaz de recordar varias
contrase&ntilde;as para distintas claves PGP O bien se escribe la
contrase&ntilde;a cada vez, o se pone la misma contrase&ntilde;a para
todas las claves que se usen.
</li>
</ul>
</body>
</html>
