<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/st
rict.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"></head>
<body>
<h1>Informaci&oacute;n de Actualizaci&oacute;n para Enigmail 0.8x</h1>

<p>Enigmail v0.8x para Thunderbird ha recibido una nueva interfaz de usuario! 
<b>Si usted est&aacute; familiarizado con las versiones de Enigmail previas a 0.8.1.0, por favor lea esta informaci&oacute;n antes de proceder</b>.</p>
<h2>Configurando Enigmail</h2>
<p>La configuraci&oacute;n de Enigmail ahora est&aacute; separada en dos partes:</p>
<ul>
<li>Configuraci&oacute;n espec&iacute;fica de Cuenta para PGP key ID, cifrado / firma por defecto</li>
<li>Preferencias globales comunes</li>
</ul>
<h3>Configuraci&oacute;n Espec&iacute;fica de Cuenta</h3>
<p>La configuraci&oacute;n espec&iacute;fica de cuenta est&aacute; disponible mediante el men&uacute;  <em>Herramientas
-&gt; Configuraci&oacute;n de Cuentas</em>. Para cada cuenta ahora hay un item de lista 
<em>Seguridad OpenPGP</em> que contiene las opciones espec&iacute;ficas para cada cuenta..</p>
<p>La configuraci&oacute;n de claves PGP de Enigmail v0.80.0 y versiones anteriores <b>no</b> son convertidas a la nueva configuraci&oacute;n por cuentas.
Por defecto, Enigmail est&aacute; <b>deshabilitado</b> para todas las cuentas!</p>
<h3>Preferencias Comunes Globales</h3>
<p>Las preferencias comunes globales han sido limpiadas y fundidas en un di&aacute;logo.
Las preferencias est&aacute;n disponibles ya sea mediante el men&uacute; Enigmail, o clickeando el bot&oacute;n <em>Avanzadas</em> en las Preferencias de Seguridad de OpenPGP en la Configuraci&oacute;n de Cuentas.</p>
<p>Una nueva opci&oacute;n ha sido a&ntilde;adida que permite activar el cifrado autom&aacute;ticamente si se responde a un mensaje cifrado. Note que esto no influye la configuraci&oacute;n para firmado de mensajes.</p>
<h2>Redactando Mensajes</h2>
<p>El comportamiento de Enigmail ha sido adaptado para ser m&aacute;s similar al comportamiento de S/MIME. Ha sido agregado un nuevo bot&oacute;n OpenPGP, 
desde el cual se puede seleccionar la configuraci&oacute;n de cifrado / firma.
El men&uacute; Enigmail ya no es utilizado para enviar mensajes cifrados o firmados, el envio se realiza &uacute;nicamente desde el bot&oacute;n normal <em>Enviar</em> o desde el men&uacute; Archivo -&gt; Enviar. <b>Se sugiere que usted pruebe estas nuevas configuraciones envi&aacute;ndose un par de mensajes a s&iacute; mismo antes de usarlo act&iacute;vamente</b>, de modo que usted comprenda el nuevo comportamiento.</p>
<p>La configuraci&oacute;n para cifrar o firmar un mensaje ahora es visible en la esquina inferior derecha de la ventana de redacci&oacute;n, con peque&ntilde;os &iacute;conos mostrando si est&aacute; activado el cifrado o la firma..</p>

<h2>Problemas Conocidos</h2>

<ul>
<li>Enigmail a&uacute;n no es cap&aacute;z de recordar varias contrase&ntilde;as para diferentes claves PGP. O bien escriba la contrase&ntilde;a por cada vez, o utilice la misma contrase&ntilde;a para todas las claves que est&eacute; utilizando.</li>
</ul>
</body>
</html>
