<html>
<head><title>Enigmail Help: Message Composition</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"></head>
<body>
<h1>Ayuda de Enigmail</h1>

<h3>Uso de Enigmail al redactar mensajes</h3>

<ul>
  <li><b>Men&uacute; Enigmail en la ventana de Redacci&oacute;n de Correo</b>
  <ul>
    <li><b>Firmar mensaje</b>: Activa/Desactiva el env&iacute;o de mensajes firmados. El usuario es notificado si el firmado falla.    </li>
    <li><b>Cifrar mensaje</b>: Activa/Desactiva el cifrado para el(los) destinatario(s) antes del env&iacute;o. El usuario es notificado si el cifrado falla.
      <p>Si  <em>Mostrar selecci&oacute;n cuando sea necesario</em> est&aacute; seleccionado en <b>Preferencias
      -&gt; pesta&ntilde;a Selecci&oacute;n de Claves</b>, una lista de claves aparecer&aacute; si hay direcciones en la lista de destinatarios para los que usted no tenga clave p&uacute;blica.</p>
      <p>Si  <em>Nunca mostrar di&aacute;logo de selecci&oacute;n de clave OpenPGP</em> est&aacute; seleccionado en <b>Preferencias
      -&gt; pesta&ntilde;a Selecci&oacute;n de Claves</b>, y hay direcciones en la lista de destinatarios para los cuales usted no tiene clave p&uacute;blica, el mensaje ser&aacute; enviado sin cifrar.</p>
    </li>
    <li><b>Usar PGP/MIME para este mensaje </b>: Activa/Desactiva el uso de
      <a href="https://tools.ietf.org/html/rfc3156" target="_blank">PGP/MIME</a>
      para este mensaje.
      <p>Si usted sabe que el(los) destinatario(s) pueden leer correos usando el formato PGP/MIME,
      usted debiera usarlo.</p>
      <p>Esta caracter&iacute;stica depende de la configuraci&oacute;n en <b>Preferencias
      -&gt; pesta&ntilde;a PGP/MIME</b> estando configurada para <em>Permitir el uso de PGP/MIME</em> o <em>Siempre usar
      PGP/MIME</em>.</p>
    </li>
    <li><b>Opciones por defecto para redacci&oacute;n</b>: Submen&uacute;.
      <ul>
        <li><b>Opciones de Firma/Cifrado...</b>: atajo a <b>Configuraci&oacute;n de Cuentas -&gt;
      Opciones de OpenPGP.</b>      </li>
        <li><b>Opciones de Env&iacute;o...</b>: atajo a la pesta&ntilde;a <b>Opciones -&gt;
      Enviando</b>.</li>
        <li><b>Opciones de Selecci&oacute;n de Clave...</b>: atajo a la pesta&ntilde;a <b>Preferencias -&gt;
      Selecci&oacute;n de Clave</b>.      </li>
        <li><b>Opciones PGP/MIME...</b>: atajo a la pesta&ntilde;a <b>Preferencias -&gt;
      PGP/MIME</b>.      </li>
      </ul>
	  </li>
    <li><b>Deshacer cifrado</b>: Si hay un fallo al momento del env&iacute;o,
    tal como el servidor POP no aceptando la petici&oacute;n,  Enigmail no sabr&aacute; al respecto, y el mensaje cifrado continuar&aacute; siendo mostrado en la ventana de Redacci&oacute;n. Elegir este &iacute;tem de men&uacute; deshar&aacute; el cifrado/firmado, devolviendo la ventana de Redacci&oacute;n a su texto original.<br>
    <em>Como una soluci&oacute;n temporal, esta opci&oacute;n puede tambi&eacute;n ser usada para descifrar el texto citado cuando se responde a mensajes cifrados. Enigmail debiera descifrar autom&aacute;ticamente el texto citado, pero si eso falla por alguna raz&oacute;n, usted puede utilizar este &iacute;tem de men&uacute; para forzarlo.</em>    </li>
    <li><b>Insertar clave p&uacute;blica</b>: inserta la clave p&uacute;blica como un bloque de texto ASCII-blindado en la posici&oacute;n actual del cursor en la ventana de Redacci&oacute;n. Se le preguntar&aacute; por la direcci&oacute;n email de la(s) clave(s) a ser insertada(s). Las Claves insertadas de esta manera ser&aacute;n reconocidas autom&aacute;ticamente en el lado receptor por Enigmail. Luego de la inserci&oacute;n de clave, usted a&uacute;n puede elegir firmar/cifrar el mensaje como sea necesario. Adem&aacute;s, no inserte m&aacute;s de un bloque de claves en un mensaje; s&oacute;lo especifique m&uacute;ltiples direcciones email, separadas por comas o espacios, cuando se le pregunte.</li>
    <li><b>Limpiar clave salvada</b>: Limpia la contrase&ntilde;a retenida. &uacute;til si usted tiene m&uacute;ltiples contrase&ntilde;as.</li>
    <li><b>Ayuda</b>: Despliega la informaci&oacute;n de Ayuda del sitio web (esta p&aacute;gina).    </li>
  </ul>
</ul>
<hr/>
<p>
M&aacute;s ayuda disponible en la
<a href="https://www.enigmail.net/support/" target="_blank">P&aacute;gina web de Ayuda de Enigmail</a></p>
</body>
</html>
