<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Ayuda de Enigmail: Lectura de mensajes</title>
</head>
<body>
<h1>Ayuda de Enigmail</h1>
<h3>Usar Enigmail para leer mensajes</h3>
<ul>
  <li><b>Bot&oacute;n de descifrar en la ventana principal del correo</b><br>
Este bot&oacute;n se puede usar para varios prop&oacute;sitos:
descifrar, verificar, o importar claves p&uacute;blicas. Normalmente el
descifrado/verificaci&oacute;n happens ocurre autom&aacute;ticamente,
aunque hay una opci&oacute;n para desactivar esto. Sin embargo, si esto
falla, normalmente aparecer&aacute; un breve mensaje de error en la
l&iacute;nea de estado de Enigmail. Si se pulsa el bot&oacute;n de
Descifrar, podr&aacute; ver un mensaje de error m&aacute;s detallado,
incluyendo la salida del comando GPG. </li>
  <li><b>Los iconos de l&aacute;piz y llave vistos en la cabecera de
mensaje</b><br>
Los iconos <em>l&aacute;piz</em> y <em>llave</em> en la cabecera del
mensaje indican si el mensaje que se est&aacute; leyendo est&aacute;
firmado y/o cifrado y si la firma es buena, es decir. que el mensaje no
se ha modificado desde el momento de su firma. Si el mensaje ha sido
modificado, el icono del <em>l&aacute;piz</em> cambiar&aacute; a un <em>l&aacute;piz
roto</em> para indicar que la firma no es correcta. Al pulsar con el
bot&oacute;n derecho del rat&oacute;n en los iconos del l&aacute;piz o
la llave, se obtendr&aacute; un men&uacute; con las siguientes
opciones:
    <ul>
      <li><em>Informaci&oacute;n de seguridad OpenPGP</em>: permite ver
el estado de salida de GPG para el mensaje.</li>
      <li><em>Copiar informaci&oacute;n de seguridad OpenPGP</em>:
copia el estado de salida de GPG al portapapeles; para pegarlo en un
mensaje de respuesta, etc.</li>
      <li><em>Ver ID Photo OpenPGP</em>: permite ver el <em>ID Photo</em>
de la persona que envi&oacute; el mensaje, si tienen una foto
incrustada en su clave p&uacute;blica. (<em>Esta opci&oacute;n
s&oacute;lo se activar&aacute; si existe un ID Photo en su clave).</em></li>
      <li><em>Informaci&oacute;n de seguridad S/MIME</em>: permite ver
la informaci&oacute;n de seguridad S/MIME del mensaje.</li>
    </ul>
    <p>Si no tiene puesta la opci&oacute;n <em>keyserver-options
auto-key-retrieve</em> en el fichero <tt>gpg.conf</tt> y lee un
mensaje que est&aacute; firmado o cifrado, ver&aacute; un icono de un <em>l&aacute;piz</em>
en el &aacute;rea de visi&oacute;n de las cabeceras con un <em>signo
de interrograci&oacute;n</em>, y la l&iacute;nea de estado de Enigmail
status line en el &aacute;rea de las cabeceras dir&aacute; <em>parte
del mensaje firmado; pulse el icono del l&aacute;piz para m&aacute;s
detalles</em> y el mensaje en el panel de mensajes mostrar&aacute;
todos los indicadores del bloque del mensaje OpenPGP y el bloque de la firma.</p>
    <p>Tambi&eacute;n se puede ver esto si tiene activada la
opci&oacute;n <em>keyserver-options auto-key-retrieve</em> en su
fichero <tt>gpg.conf</tt> y la clave PGP no est&aacute; disponible en
el servidor de claves predeterminado.</p>
    <p>Al pulsar en el icono del <em>l&aacute;piz y la
interrogaci&oacute;n</em> abrir&aacute; una ventana avisando qque la
clave no est&aacute; disponible en el anillo de claves. Al pulsar en
Aceptar abrir&aacute; otra ventana con una lista de servidores de
claves de los que puede seleccionar para descargar la clave
p&uacute;blica del remitente.</p>
    <p>Para configurar la lista de servidores de claves que desee usar,
vaya a la pesta&ntilde;a <b>Enigmail -&gt; Preferencias -&gt; Basico</b>
e introduzca la direcci&oacute;n de los servidores de claves en el
recuadro <em>Servidores de claves:</em>, separados por una coma. <em>El
primer servidor de claves de la lista se usar&aacute; como
predeterminado.</em></p>
  </li>
  <li><b>Abrir adjuntos cifrados / importar claves OpenPGP adjuntas</b><br>
Los adjuntos con el nombre *.pgp, *.asc y *.gpg se reconocen como
adjuntos que se pueden manejar especialmente con Enigmail. Al pulsar
con el bot&oacute;n derecho en un adjunto de este tipo se activan dos
elementos especiales en el men&uacute; contextual: <em>Descifrar y
Abrir</em> y <em>Descifrar y Guardar</em>. Use estos elementos si
desea que Enigmail descifre un adjunto antes de abrirlo o guardarlo. Si
se reconoce un adjunto como un fichero de clave OpenPGP, se le
ofrece la posibilidad de importar las claves en sus anillos. </li>
</ul>
<hr>
<p>Hayy m&aacute;s ayuda disponible en la
<a href="http://enigmail.mozdev.org/help.html" target="_blank">p&aacute;gina
web de ayuda de Enigmail</a>
</p>
</body>
</html>
