<?xml version="1.0" encoding="utf8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<meta name="author" content="EduLeo" />
<title>Ayuda de Enigmail: Redacci&oacute;n de mensajes</title>
</head>

<body>
<h1>Ayuda de Enigmail</h1>
<h3>Usando Enigmail para redactar mensajes</h3>
<ul>
<li><strong>Men&uacute; Enigmail en la ventana de redacci&oacute;n de mensajes</strong>
<ul>
<li><strong>Firmar mensaje</strong>: Activa/desactiva el env&iacute;o de correo firmado. El usuario recibe una notificaci&oacute;n si hay un fallo en la firma.</li>
<li><strong>Cifrar mensaje</strong>: Activa/desactiva el cifrado para todos los destinatarios antes de enviarlo. El usuario recibe una notificaci&oacute;n si hay un fallo al cifrar.
<p>Si est&aacute; activada la opci&oacute;n <em>Mostrar la selecci&oacute;n si es necesario</em> en <strong>Preferencias -&gt; pesta&ntilde;a Selecci&oacute;n de clave</strong>, se abrir&aacute; una ventana con una lista de claves si hay direcciones en la lista de destinatarios del mensaje de las que no se tiene la clave p&uacute;blica.</p>
<p>Si est&aacute; activada la opci&oacute;n <em>Nunca mostrar el di&aacute;logo de selecci&oacute;n de clave OpenPGP</em> en <strong>Preferencias -&gt; pesta&ntilde;a Selecci&oacute;n de clave</strong>, y hay direcciones en la lista de destinatarios del mensaje de las que no se tiene la clave p&uacute;blica, el mensaje se enviar&aacute; sin cifrar.</p>
</ul></li>
<li><strong>Usar PGP/MIME en este mensaje</strong>: Activa/desactiva el uso de <a href="https://tools.ietf.org/html/rfc3156" onclick="window.open('https://tools.ietf.org/html/rfc3156');return false">PGP/MIME</a> en este mensaje.
<p>Si sabe con certeza que los destinatarios pueden leer el correo usando el formato PGP/MIME, entonces se debe usar.</p>
<p>Esta caracter&iacute;stica depende de la configuraci&oacute;n en <strong>Preferencias -&gt; pesta&ntilde;a PGP/MIME</strong> si est&aacute; establecida en <em>Usar PGP/MIME si es posible</em> o <em>Siempre usar PGP/MIME</em>.</p>
<ul>
<li><strong>Opciones predeterminadas de redacci&oacute;n</strong>: Submen&uacute;</li>
<li><strong>Opciones de firmado/cifrado...</strong>: acceder a <strong>Configuraci&oacute;n de cuentas... -&gt; Seguridad OpenPGP</strong>.</li>
<li><strong>Opciones de env&iacute;o...</strong>: acceder a <strong>Preferencias -&gt; pesta&ntilde;a Enviar</strong>.</li>
<li><strong>Opciones de selecci&oacute;n de clave...</strong>: acceder a <strong>Preferencias -&gt; pesta&ntilde;a Selecci&oacute;n de clave</strong>.</li>
<li><strong>Opciones PGP/MIME...</strong>: acceder a <strong>Preferencias -&gt; pesta&ntilde;a PGP/MIME</strong>.</li>
</ul></li>
<li><strong>Deshacer cifrado</strong>: Si hay alg&uacute;n problema al enviar el correo, como un fallo en el servidor POP que no acepta la solicitud, Enigmail no lo sabr&aacute;, y el mensaje cifrado seguir&aacute; mostr&aacute;ndose en la ventana de redacci&oacute;n. Con esta opci&oacute;n de men&uacute;, se deshacer&aacute; el cifrado/firma, volviendo a la ventana de redacci&oacute;n con su texto original.<br />
<em>Como soluci&oacute;n temporal, tambi&eacute;n se puede usar para descifrar el texto citado al contestar a mensajes cifrados. Enigmail debe descifrar autom&aacute;ticamente el mensaje citado, pero si se produce un fallo por cualquier motivo, se puede usar esta opci&oacute;n del men&uacute; para forzarlo</em>.</li>
<li><strong>Adjuntar clave p&uacute;blica...</strong>: Adjunta el bloque de la clave p&uacute;blica al mensaje, en un archivo con armadura ASCII. Se le preguntar&aacute; el ID de usuario de las claves que se van a adjuntar.</li>
<li><strong>Borrar frase contrase&ntilde;a guardada</strong>: Elimina de la cach&eacute; las frases contrase&ntilde;as introducidas manualmente. Esto es &uacute;til si se tienen varias frases contrase&ntilde;as.</li>
<li><strong>Ayuda</strong>: Muestra informaci&oacute;n de ayuda (esta p&aacute;gina).</li>
</ul><hr/>
<p>M&aacute;s ayuda disponible en la <a href="https://www.enigmail.net/support/" onclick="window.open('https://www.enigmail.net/support/');return false">p&aacute;gina Web de ayuda de Enigmail</a></p>
</body></html>
