<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="author" content="EduLeo" />
<title>Ayuda de Enigmail: Editar regla OpenPGP</title>
</head>

<body>
<h1>Ayuda de Enigmail</h1>
<h3>Usando el editor de reglas de Enigmail: Editar regla OpenPGP</h3>
<p>En el editor de reglas, se pueden especificar opciones predeterminadas para cada destinatario, activando el cifrado, la firma y PGP/MIME; y para definir qu&eacute; clave(s) OpenPGP va a usar. En este di&aacute;logo, se pueden especificar las reglas para un &uacute;nico destinatario, y para un grupo de destinatarios con atributos muy similares.</p>
<ul>
<li><strong>Definir reglas OpenPGP para</strong>: Contiene las direcciones de correo electr&oacute;nico de los destinatarios (sin nombre, por ejemplo una direcci&oacute;n como <tt>alguien@correo.org</tt>). Se pueden especificar varias direcciones de correo, separadas por espacios. La direcci&oacute;n especificada aqu&iacute; puede consistir de s&oacute;lo la secci&oacute;n del dominio, para que se aplique al correo de cualquier direcci&oacute;n de ese dominio, como <tt>@correo.org</tt> se aplicar&aacute; a <tt>alguien@correo.org</tt>, <tt>cualquiera@correo.org</tt>, <tt>otro@correo.org</tt>, etc.</li>
<li><strong>Aplicar regla si el destinatario</strong>: Esto modifica si coinciden las direcciones de correo electr&oacute;nico. Si se introducen varias direcciones, la opci&oacute;n se aplicar&aacute; a todas. Los ejemplos de abajo est&aacute;n basados en que se ha introducido <tt>alguien@correo.org</tt> en el campo <em>Reglas openPGP</em> de arriba.<ul>
<li><em>Es exactamente</em>: Con esta opci&oacute;n, la regla s&oacute;lo se activar&aacute; en los correos a <tt>alguien@correo.org</tt> (exacto, no se tienen en cuenta las may&uacute;sculas).</li>
<li><em>Contiene</em>: Con esta opci&oacute;n, cualquier direcci&oacute;n de correo que contenga la cadena, cumplir&aacute; la regla, como <tt>unnombre@correo.dominio</tt> o <tt>nombre@correo.dominio.org</tt></li>
<li><em>Comienza con</em>: Con esta opci&oacute;n, cualquier direcci&oacute;n de correo que empiece por la cadena, cumplir&aacute; la regla, como <tt>alguien@correo.dominio.net</tt>, <tt>alguien@correo.nombre-dominio.com</tt>.</li>
<li><em>Acaba en</em>: Con esta opci&oacute;n, cualquier direcci&oacute;n de correo que acabe en la cadena, cumplir&aacute; la regla, como <tt>otronombre@correo.org</tt>, <tt>alguien@correo.org</tt></li>
</ul></li>
<li><strong>Continuar con la regla siguiente para la direcci&oacute;n coincidente</strong><br />
Activar esta funci&oacute;n permitir&aacute; definir una regla pero no tener que especificar un ID de clave en el campo <em>Usar las siguientes claves OpenPGP:</em> para que se use la direcci&oacute;n de correo electr&oacute;nico para comprobar una clave en el momento del env&iacute;o. Tambi&eacute;n se procesar&aacute;n las reglas posteriores para la misma direcci&oacute;n.</li>
<li><strong>No comprobar las reglas siguientes para la direcci&oacute;n coincidente</strong><br />
Activar esta funci&oacute;n detiene el procesamiento de cualquier otra regla para las direcciones que cumplan la regla. Es decir, las reglas se reanudan procesando el pr&oacute;ximo destinatario.</li>
<li><strong>Usar las siguientes claves OpenPGP:</strong><br />
Use el bot&oacute;n <em>Seleccionar clave(s)...</em> para seleccionar las claves del destinatario que se usen para el cifrado. Al igual que la acci&oacute;n anterior, no se contin&uacute;an procesando las reglas para las direcciones que cumplan la regla.</li>
<li><strong>Predeterminada para firmar</strong>: Activa o desactiva la firma del mensaje. Esta opci&oacute;n usa o ignora lo especificado en la ventana de redacci&oacute;n de mensajes. Los valores son:
<br /><ul>
<li><em>Nunca</em>: Desactiva la firma, incluso si se activ&oacute; en la ventana de redacci&oacute;n de mensajes (tiene preferencia sobre los otros valores).</li>
<li><em>S&iacute;, si est&aacute; seleccionada en la redacci&oacute;n del mensaje</em>: Deja la firma como se haya especificado en la ventana de redacci&oacute;n de mensajes.</li>
<li><em>Siempre</em>: Activa la firma, incluso si <strong>no</strong> estaba activada en la ventana de redacci&oacute;n de mensajes.</li>
</ul>
</li>
</ul>
<div style="margin-left: 40px;">Estas opciones de firma se aplican a todas las reglas que coincidan con el criterio. Si una de las reglas desactiva la firma, el mensaje no se firmar&aacute;, independientemente de que otras especifiquen <em>Siempre</em>.<br /></div>
<ul><li><strong>Cifrar</strong>: Activa o desactiva el cifrado del mensaje. Las opciones permitidas y su significado son las mismas que para la firma de mensajes.</li>
<li><strong>PGP/MIME</strong>: Activa o desactiva el uso de la codificaci&oacute;n PGP/MIME (RFC 3156) en el mensaje. Si PGP/MIME est&aacute; desactivado, los mensajes se codifican usando "PGP integrado". Los valores permitidos y su significado son los mismos que para la firma de mensajes.</li>
</ul>
<p>Las reglas se procesan en el orden mostrado en la lista de <em>OpenPGP - Editar reglas por destinatario</em>. Cuando una regla coincida con un destinatario y contenga un ID de clave OpenPGP, adem&aacute;s de usar el ID de clave especificado, el destinatario ya no se considera cuando se procesen m&aacute;s reglas.</p>
<hr /><p>M&aacute;s ayuda disponible en la <a href="https://www.enigmail.net/documentation/pgprules_file.php" onclick="window.open('https://www.enigmail.net/pgprules_file.html');return false">p&aacute;gina de configuraci&oacute;n por destinatario de Enigmail</a></p>
</body></html>
