<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Enigmail Help: How to Resolve Problems with Initializing OpenPGP</title>
  <style type="text/css">
  /*<![CDATA[*/
    dt  { font-weight: bold;  }
  /*]]>*/
  </style>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" /></head>

<body>
  <h1>Ayuda de Enigmail</h1>

  <h3>C&oacute;mo Resolver Problemas al Iniciar OpenPGP</h3>

  <p>Hay varias razones por las que no se tiene &eacute;xito al inicializar OpenPGP. Las m&aacute;s comunes son descritas m&aacute;s abajo &amp;
     para m&aacute;s informaci&oacute;n por favor visite la  <a href="https://www.enigmail.net/support/" target="_blank">p&aacute;gina de Soporte de Enigmail.</a></p>

  <dl>
    <dt>No se pudo encontrar GnuPG</dt>
    <dd>
    <p>
      Para que funcione OpenPGP, la herramienta <a href="https://www.gnupg.org/" target="_blank">GnuPG</a> debe ser instalada.
      Si GnuPG no puede ser encontrado, entonces primero aseg&uacute;rese de que el ejecutable <tt>gpg.exe</tt> (en Windows&amp; <tt>gpg</tt> en otras plataformas) est&eacute; instalado en su computador.
      Si GnuPG est&aacute; instalado, y OpenPGP no puede encontrarlo, entonces usted necesitar&aacute; configurar manualmente la ruta a GnuPG en las Preferencias de OpenPGP (men&uacute; <i>OpenPGP</i> &gt; <i>Preferencias</i>)    </p>

    <dt>Enigmime fall&oacute; al inicilizarse</dt>

    <dd>
      <p>
      OpenPGP solamente funciona si es compilado usando el mismo ambiente de compilaci&oacute;n en que Thunderbird o SeaMonkey fue compilado. Esto significa que usted s&oacute;lo puede usar la versi&oacute;n oficial de Enigmail si utiliza las versiones oficiales de Thunderbird o SeaMonkey provistas por <a href="www.mozilla.org">mozilla.org</a>.      </p>
      <p>
      Si usted utiliza una versi&oacute;n de Thunderbird o SeaMonkey provista por otra fuente (p.ej. el proveedor de su distribuci&oacute;n de Linux), o si usted compil&oacute; la aplicaci&oacute;n por si mismo, ustede debe, o bien usar una versi&oacute;n de Enigmail del mismo proveedor, o compilar Enigmail usted mismo. Para compilar Enigmail, refi&eacute;rase a la <a href="https://www.enigmail.net/download/source.php">secci&oacute;n de C&oacute;digo Fuente</a> en la p&aacute;gina de Enigmail. Por favor no envie reportes de bugs acerca de este problema, no puede ser solucionado.</p>
    </dd>
  </dl>

  <p>M&aacute;s ayuda est&aacute; disponible en el <a href="https://www.enigmail.net/support/troubles.php" target="_blank">Sitio Web de Soporte de Enigmail</a>.</p>
</body>
</html>
