<html>
<head><title>Ajuda Enigmail: Redacci&oacute; de missatge</title>
</head>
<body>
<h1>Ajuda Enigmail</h1>

<h3>Emprant l'Enigmail per redactar missatges</h3>

<ul>
  <li><b>El men&uacute; Enigmail a la finestra de Redacci&oacute;</b>
    <li><b>Signa missatge</b>: Activa/desactiva l'enviament de correu signat. S'avisa a l'usuari si falla
    la signatura.
    </li>
    <li><b>Xifra missatge</b>: Activa/desactiva el xifratge a tots els destinataris abans d'enviar.
    S'avisa a l'usuari si falla el xifratge.
	<p>Si s'ha activat <em>Mostra la selecci&oacute; nom&eacute;s quan es necessiti</em> a <b>Prefer&egrave;ncies
	-&gt; Pestanya de selecci&oacute; de claus</b>, s'obrir&agrave; una llista de claus si hi ha adreces a la llista de
	destinataris del missatge pels que no teniu una clau p&uacute;blica.</p>
	<p>Si s'ha activat <em>No mostris mai el di&agrave;leg de selecci&oacute; de claus OpenPGP</em> a <b>Prefer&egrave;ncies
	-&gt; Pestanya de selecci&oacute; de claus</b>, i hi ha adreces a la llista de destinataris del missatge pels
	que no teniu una clau p&uacute;blica, el missatge s'enviar&agrave; sense xifrar.</p>
    </li>
    <li><b>Empra PGP/MIME en aquest missatge</b>: Activa/desactiva l'&uacute;s del
	<a href="http://community.roxen.com/developers/idocs/rfc/rfc3156.html">PGP/MIME</a>
	en aquest missatge.
	<p>Si teniu coneixement que el(s) destinatari(s) pot llegir el correu codificat amb el format PGP/MIME,
	haur&iacute;eu d'activar-lo.</p>
	<p>Aquesta funcionalitat dep&egrave;n de si estan actius els par&agrave;metres <em>Permet l'&uacute;s de PGP/MIME</em> o
	<em>Empra sempre PGP/MIME</em> a <b>Prefer&egrave;ncies -&gt; Pestanya PGP/MIME</b>.</p>
	</li>
    <li><b>Opcions de redacci&oacute; predeterminades</b>: Submen&uacute;.
    <ul>
      <li><b>Opcions de signatura/xifratge...</b>: drecera a <b>Par&agrave;metres del compte -&gt;
	  Opcions OpenPGP.</b>
      </li>
      <li><b>Opcions d'enviament...</b>: drecera a la pestanya <b>Prefer&egrave;ncies -&gt;
	  Enviament</b>.
      </li>
      <li><b>Opcions de selecci&oacute; de clau...</b>: drecera a la pestanya <b>Prefer&egrave;ncies -&gt;
	  Selecci&oacute; de clau</b>.
      </li>
      <li><b>Opcions PGP/MIME...</b>: drecera a la pestanya <b>Prefer&egrave;ncies -&gt;
	  PGP/MIME</b>.
      </li>
    </ul>
	  </li>
    <li><b>Desf&eacute;s el xifratge</b>: Si hi ha una errada quan s'envi&iuml; el corrreu,
    p.ex. que el servidor POP no accepta la petici&oacute;, l'Enigmail no se n'assabentar&agrave;,
    i el missatge xifrat continuar&agrave; mostrant-se a la finestra de redacci&oacute;.
    Seleccionant aquesta opci&oacute; del men&uacute; es desfar&agrave; el xifratge/signatura, i es revertir&agrave;
    la finestra de redacci&oacute; al text original.<br>
    <em>Com a soluci&oacute; provisional, aquesta opci&oacute; es pot emprar per a desxifrar el text
    citat en respondre a missatges xifrats. L'Enigmail hauria de desxifrar autom&agrave;ticament
    el missatge citat, per&ograve; si aix&ograve; falla per alguna ra&oacute;, podeu emprar aquesta opci&oacute; del men&uacute;
    per a for&ccedil;ar-ho.</em>
    </li>
    <li><b>Insereix la clau p&uacute;blica</b>: insereix el bloc ASCII-cuirassat amb la clau p&uacute;blica a
     la posici&oacute; actual del cursor de la finestra de redacci&oacute;. Es sol&middot;licitar&agrave; l'adre&ccedil;a de correu
     de la clau(s) a inserir. Les claus inserides d'aquesta manera es reconeixeran autom&agrave;ticament
     a la recepci&oacute; per l'Enigmail. Despr&eacute;s de l'inserci&oacute; de la clau, encara podeu
     signar/xifrar el correu si us cal. No inseriu m&eacute;s d'un bloc de clau a un missatge; nom&eacute;s indiqueu
     v&agrave;ries adreces de correu, separades per comes o espais quan es sol&middot;liciti.
    </li>
    <li><b>Neteja la contrasenya desada</b>: Neteja la contrasenya memoritzada. &Eacute;s &uacute;til
    si teniu v&agrave;ries contrasenyes.
    </li>
    <li><b>Ajuda</b>: Mostra la informaci&oacute; d'ajuda del lloc web (aquesta p&agrave;gina).
    </li>
</ul>
<hr/>
<p>
Teniu m&eacute;s ajuda a la vostra disposici&oacute; a la
<a href="http://www.enigmail.net/support/" target="_blank">p&agrave;gina web de l'Enigmail</a>
</p>
</body>
</html>
