<html>
<head><title>Ajuda Enigmail: Lectura de missatges</title>
</head>
<body>
<h1>Ajuda Enigmail</h1>

<h3>Emprant l'Enigmail per llegir missatges</h3>
<ul>
  <li><b>Bot&oacute; Desxifra a la finestra principal de la Missatgeria</b><br>
  Aquest bot&oacute; es pot emprar per a varies funcions: desxifrar, verificar o importar claus p&uacute;bliques.
  Normalment, el desxiframent/verificaci&oacute; &eacute;s autom&agrave;tic, encara que es pot desactivar amb una opci&oacute;.
  Tanmateix, si aix&ograve; falla, es mostrar&agrave; un missatge curt d'error a la l&iacute;nia d'estat de l'Enigmail.
  Si feu un clic al bot&oacute; Desxifra, podreu veure un missatge d'error m&eacute;s detallat, incl&ograve;sa la sortida de l'ordre GPG.
  </li>
  <li><b>Icones del llapis i la clau al visualitzador de cap&ccedil;aleres del missatge</b><br>
  Les icones del <em>llapis</em> i la <em>clau</em> al visualitzador de cap&ccedil;aleres del missatge indiquen
  si el missatge que esteu llegint ha estat signat i/o xifrat. Si el missatge ha estat modificat, la icona del
  <em>llapis</em> canviar&agrave; a un <em>llapis trencat</em> per a indicar que la signatura &eacute;s dolenta.
  Fent un clic amb el bot&oacute; dret a la icona del llapis o de la clau mostrar&agrave; un men&uacute; amb les seg&uuml;ents opcions:
  <ul>
  <li><em>Informaci&oacute; de seguretat OpenPGP</em>: us permet veure l'estat de la sortida GPG del missatge.</li>
  <li><em>Copia la informaci&oacute; de seguretat OpenPGP</em>: copia l'estat de la sortida GPG al porta-retalls;
  enganxar-lo a un missatge de resposta, etc.</li>
  <li><em>Mostra l'identificador de foto OpenPGP</em>: us permet veure l'<em>identificador de foto</em> de la
  persona que envia el missatge, si ha incrustat una foto a la seva clau p&uacute;blica.
  (<em>Aquesta opci&oacute; nom&eacute;s s'activar&agrave; si existeix l'identificador de foto a la seva clau.)</em></li>
  <li><em>Informaci&oacute; de seguretat S/MIME</em>: us permet veure la informaci&oacute; de seguretat S/MIME del missatge.</li>
  </ul>
  <p>Si no heu establert l'opci&oacute; <em>keyserver-options auto-key-retrieve</em> al vostre fitxer
  <tt>gpg.conf</tt> i llegiu un missatge que est&agrave; signat o xifrat,
  veureu la icona d'un <em>llapis</em> a l'&agrave;rea de visualitzaci&oacute; de les cap&ccedil;aleres amb un <em>interrogant</em>,
  i la l&iacute;nia d'estat de l'Enigmail a l'&agrave;rea de cap&ccedil;aleres indicar&agrave; <em>Part
  del missatge signat; feu un clic a la icona del llapis pels detalls</em> i el missatge de la subfinestra
  de la Missatgeria mostrar&agrave; tots els indicadors del bloc PGP del missatge i el bloc de signatura.</p>
  <p>Tamb&eacute; podreu veure aix&ograve; si teniu establerta l'opci&oacute; <em>keyserver-options auto-key-retrieve</em>
  al vostre fitxer <tt>gpg.conf</tt> i la clau PGP no es troba en el servidor de claus predeterminat.</p>
  <p>En fer un clic a la icona del <em>llapis amb interrogant</em> s'obrir&agrave; una finestra avisant que
  la clau no est&agrave; al vostre anell de claus. Si feu un clic a D'acord s'obrir&agrave; una altra finestra amb una
  llista dels servidors de claus que podeu seleccionar per a baixar la clau p&uacute;blica del remitent.</p>
  <p>Per a configurar la llista dels servidors de claus que voleu usar, aneu a la pestanya <b>Enigmail -&gt;
  Prefer&egrave;ncies -&gt; B&agrave;sic</b> i introdu&iuml;u les adreces dels servidors de claus a la caixa
  <em>Servidor(s) de claus:</em>, separats per comes. <em>El primer servidor de claus ser&agrave; el
  predeterminat.</em></p>
  </li>
  <li><b>Obrint fitxers adjunts xifrats / important claus PGP adjuntes</b><br>
  Els fitxers adjunts anomenats *.pgp, *.asc i *.gpg es reconeixen com adjunts que l'Enigmail pot gestionar de manera
  especial. Fent un clic amb el bot&oacute; dret en aquests adjunts s'activen dos elements especials del men&uacute; contextual:
  <em>Desxifra i obre</em> i <em>Desxifra i desa</em>. Empreu aquests dos elements del men&uacute; si voleu que l'Enigmail
  desxifri un adjunt abans d'obrir-lo o desar-lo. Si un adjunt es reconeix com un fitxer de clau PGP,
  se us oferir&agrave; la possibilitat d'importar la clau al vostre anell de claus.
  </li>
</ul><hr/>
<p>
Teniu m&eacute;s ajuda a la vostra disposici&oacute; a la
<a href="https://www.enigmail.net/support/" target="_blank">p&agrave;gina web de l'Enigmail</a>
</p>
</body>
</html>
