<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Ajuda do Enigmail: Como Resolver Problemas com a Inicializa&ccedil;&atilde;o do OpenPGP</title>
  <style type="text/css">
  /*<![CDATA[*/
    dt  { font-weight: bold;  }
  /*]]>*/
  </style>
</head>

<body>
  <h1>Ajuda do Enigmail</h1>

  <h3>Como Resolver Problemas Com a Inicializa&ccedil;&atilde;o do OpenPGP</h3>

  <p>Existem diversas raz&otilde;es pelas quais a inicializa&ccedil;&atilde;o do OpenPGP pode falhar. As mais comuns est&atilde;o descritas abaixo;
     Para mais informa&ccedil;&otilde;es visite a <a href="https://www.enigmail.net/support/" target="_blank">p&aacute;gina de suporte do Enigmail.</a></p>

  <dl>
    <dt>GnuPG n&atilde;o pode ser encontrado</dt>
    <dd>
    <p>
      Para que o OpenPGP funcione, a ferramenta <a href="https://www.gnupg.org/" target="_blank">GnuPG</a> precisa estar instalada.
      Caso o GnuPG n&atilde;o seja encontrado, verifique primeiramente se o arquivo execut&aacute;vel <tt>gpg.exe</tt> (no Windows; <tt>gpg</tt> nas outras plataformas) est&aacute; instalado em seu computador.
      Caso o GnuPG esteja instalado, e o OpenPGP n&atilde;o consiga encontr&aacute;-lo, voc&ecirc; precisar&aacute; informar manualmente o caminho para ele nas Prefer&ecirc;ncias do OpenPGP Preferences (menu <i>OpenPGP</i> &gt; <i>Prefer&ecirc;ncias</i>)
    </p>

    <dt>Falha ao inicializar o Enigmime</dt>

    <dd>
      <p>
      O OpenPGP funciona apenas se tiver sido compilado utilizando-se o mesmo ambiente utilizado para construir o Thunderbird ou SeaMonkey. Isto significa que voc&ecirc; apenas pode utilizar uma vers&atilde;o oficial do Enigmail se utilizar tamb&eacute;m uma vers&atilde;o oficial do Thunderbird ou SeaMonkey fornecida pela <a href="www.mozilla.org">mozilla.org</a>.
      </p>
      <p>
      Caso voc&ecirc; utilize uma vers&atilde;o do Thunderbird ou SeaMonkey de outro fornecedor (por exemplo, do distribuidor de sua distribui&ccedil;&atilde;o Linux), ou se voc&ecirc; mesmo compilou a aplica&ccedil;&atilde;o, voc&ecirc; deve utilizar uma vers&atilde;o constru&iacute;da pelo mesmo fornecedor, ou compilar uma vers&atilde;o do Enigmail. Para compilar o Enigmail, siga as instru&ccedil;&otilde;es na <a href="https://www.enigmail.net/download/source.php">se&ccedil;&atilde;o C&oacute;digo Fonte</a> na p&aacute;gina do Enigmail. Por favor n&atilde;o abra relat&oacute;rios de erro sobre este problema, ele n&atilde;o pode ser resolvido de outra maneira.
      </p>
    </dd>
  </dl>
  <p>Mais ajuda est&aacute; dispon&iacute;vel na <a href="https://www.enigmail.net/support/troubles.php" target="_blank">P&aacute;gina de Suporte do Enigmail</a>.</p>
</body>
</html>
