<html>
<head><title>Axuda de Enigmail: Composici&oacute;n de Mensaxe</title>
</head>
<body>
<h1>Axuda de Enigmail</h1>

<h3>Usando Enigmail para compo&ntilde;er mensaxes</h3>

<ul>
  <li><b>Men&uacute; de Enigmail na vent&aacute; de Composici&oacute;n de correo</b>
  <ul>
    <li><b>Asinar mensaxe</b>: Activa/Desactiva o env&iacute;o de correo asinado. O
    usuario ou usuaria son notificados se a sinatura falla.
    </li>
    <li><b>Cifrar mensaxe</b>: Activar/Desactiva o cifrado a todos os destinatarios
    ou destinatarias antes do env&iacute;o. Notif&iacute;case en caso de que se produza un erro no
    cifrado.
	<p>Se <em>Mostrar selecci&oacute;n cando sexa necesario</em> est&aacute; definido na pestana de
	<b>Preferencias -&gt; Selecci&oacute;n de chaves</b>, mostrarase unha listaxe de chaves se
	hai alg&uacute;n enderezo na lista de destinatarios/as da mensaxe para os/as que non ten
	chave p&uacute;blica.</p>
	<p>Se a opci&oacute;n de <em>non mostrar nunca o di&aacute;logo de selecci&oacute;n de chaves OpenPGP</em>
	est&aacute; activado na pestana <b>Preferencias -&gt; Selecci&oacute;n de chaves</b>, e hai enderezos
	na lista de destinatarios/as para os que non ten a chave p&uacute;blica, a mensaxe enviaras
	sen cifrar.</p>
    </li>
    <li><b>Usar PGP/MIME para esta mensaxe</b>: Activa/Desactiva o uso de	<a href="https://tools.ietf.org/html/rfc3156" target="_blank">PGP/MIME</a>
	para esta mensaxe.
	<p>Se sabe que o(s) destinatario(s) ou destinataria(s) poden ler correo utilizando o
	formato PGP/MIME, deber&iacute;a utilizalo.</p>
	<p>Esta caracter&iacute;stica depende da configuraci&oacute;n na pestana <b>Preferencias
	-&gt; PGP/MIME</b> sendo a opci&oacute;n <em>Permitir o uso de PGP/MIME</em> ou <em>Usar sempre
	PGP/MIME</em>.</p>
	</li>
    <li><b>Opci&oacute;ns predeterminadas para a composici&oacute;n</b>: Submen&uacute;.
    <ul>
      <li><b>Opci&oacute;ns de Sinatura/Cifrado...</b>: atallo a <b>Configuraci&oacute;n das contas -&gt;
	  Opci&oacute;ns OpenPGP.</b>
      </li>
      <li><b>Opci&oacute;ns de env&iacute;o...</b>: atallo &aacute; pestana <b>Preferencias -&gt;
	  Env&iacute;o</b>.
      </li>
      <li><b>Opci&oacute;ns de selecci&oacute;n de chaves...</b>: atallo &aacute; pestana <b>Preferencias -&gt;
	  Selecci&oacute;n de chaves</b>.
      </li>
      <li><b>Opci&oacute;ns PGP/MIME...</b>: atallo &aacute; pestana <b>Preferencias -&gt;
	  PGP/MIME</b>.
      </li>
    </ul>
	  </li>
    <li><b>Desfacer cifrado</b>: Se hai un fallo ao enviar un correo, como o
    servidor POP que non acepta unha solicitude, Enigmail non pode sabelo, e a
    mensaxe cifrada seguir&aacute; na vent&aacute; de composici&oacute;n. Escollendo este elemento do
    men&uacute; desfarase o cifrado/sinatura, volvendo o texto orixial &aacute; vent&aacute; de
    composici&oacute;n.<br>
    <em>Como un arranxo temporal, esta opci&oacute;n pode utilizarse para descifrar o
    texto comentado ao responder mensaxes cifradas. Enigmail deber&iacute;a descifrar
    a mensaxe automaticamente, mais se falla por algunha raz&oacute;n, pode utilizar
    este elemento do men&uacute; para forzalo.</em>
    </li>
    <li><b>Inserir chave p&uacute;blica</b>: insire a chave p&uacute;blica nun bloque ASCII-armado
    na posici&oacute;n actual do cursos na vent&aacute; de composici&oacute;n. Pedir&aacute;selle o enderezo da
    chave que quere inserir. As chaves inseridas desta maneira ser&aacute;n reco&ntilde;ecidas
    automaticamente ao seren recividas por Enigmail. Despois da inserci&oacute;n da chave,
    pode tam&eacute;n escoller asinar/cifrar o correo se &eacute; preciso. De todos xeitos, non
    insira m&aacute;is dun bloque de chaves nunha mensaxe; simplemente especifique m&uacute;ltiples
    enderezos de correo, separados por comas ou espazos, cando se lle pregunte.
    </li>
    <li><b>Limpar contrasinais gardados</b>: Limpa os contrasinais gardados en cach&eacute;.
    &Uacute;til se ten m&uacute;ltiples contrasinais.
    </li>
    <li><b>Axuda</b>: Mostra informaci&oacute;n de axuda desde o sitio web (esta p&aacute;xina).
    </li>
  </ul>
  </li>
</ul>
<hr/>
<p>
M&aacute;is axuda dispo&ntilde;&iacute;bel na
<a href="https://www.enigmail.net/support/" target="_blank">p&aacute;xina web de Axuda de Enigmail</a>
</p>
</body>
</html>
