<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/st
rict.dtd">
<html>
<head>
</head>
<body>
<h1>Informa&ccedil;&otilde;es de Atualiza&ccedil;&atilde;o para o Enigmail 0.8x</h1>

<p>O Enigmail v0.8x para Thunderbird recebeu uma nova interface de usu&atilde;rio!
<b>Se voc&ecirc; est&aacute; familiarizado com as vers&otilde;es do Enigmail anteriores a 0.81.0, por favor leia
estas informa&ccedil;&otilde;es antes de continuar</b>.
</p>
<h2>Configurando o Enigmail</h2>
<p>A configura&ccedil;&atilde;o do Enigmail agora &eacute; dividida em duas partes:</p>
<ul>
<li>Configura&ccedil;&otilde;es espec&iacute;ficas de conta para o ID de chave PGP, criptografia / assinatura padr&otilde;es
</li>
<li>Prefer&ecirc;ncias Globais Comuns
</li>
</ul>
<h3>Configura&ccedil;&otilde;es Espec&iacute;ficas de Conta</h3>
<p>As configura&ccedil;&otilde;es espec&iacute;ficas de conta est&atilde;o dispon&iacute;veis atrav&eacute;s do menu <em>Ferramentas
-&gt; Configura&ccedil;&otilde;es de Conta</em>. Para cada conta agora existe um item na lista <em>Seguran&ccedil;a OpenPGP</em> 
que cont&eacute;m as op&ccedil;&otilde;es espec&iacute;ficas para cada conta.
</p>
<p>As configura&ccedil;&otilde;es de chave PGP do Enigmail v0.80.0 e vers&otilde;es mais antigas <b>n&atilde;o</b> s&atilde;o 
convertidas no novo formato por conta.
O Enigmail &eacute; por padr&atilde;o <b>desabilitado</b> para todas as contas!
</p>
<h3>Prefer&ecirc;ncias Globais Comuns</h3>
<p>As configura&ccedil;&otilde;es globais comuns foram re-organizadas e combinadas em um di&aacute;logo &uacute;nico.
As prefer&ecirc;ncias est&atilde;o dispon&iacute;veis atrav&eacute;s do menu do Enigmail, ou clicando no bot&atilde;o <em>Avan&ccedil;ado</em> 
nas Prefer&ecirc;ncias de Seguran&ccedil;a OpenPGP do Gerenciador de Contas.
</p>
<p>Uma nova op&ccedil;&atilde;o foi acrescentada, que permite que voc&ecirc; ligue a criptografia automaticamente
se estiver respondendo a uma mensagem criptografada. Note que isto n&atilde;o influencia as configura&ccedil;&otilde;es de assinatura de mensagem.
</p>
<h2>Compondo Mensagens</h2>
<p>O comportamento do Enigmail foi adaptado para ser mais semelhante ao
comportamento do S/MIME. Um novo bot&atilde;o OpenPGP foi acrescentado, 
a partir do qual as configura&ccedil;&otilde;es de criptografia / assinatura podem ser selecionadas.
O menu do Enigmail n&atilde;o serve mais para enviar mensagens criptografadas ou assinadas, todo o envio agora &eacute; 
feito a partir do bot&atilde;o <em>Enviar</em> ou atrav&eacute;s do menu Arquivo -&gt; Enviar. <b>&Eacute; recomendado
que vo&ecirc; tente as novas configura&ccedil;&otilde;es enviando algumas mensagens para si mesmo antes de utiliz&aacute;-lo
ativamente</b>, de forma que voc&ecirc; se entenda o funcionamento do novo comportamento do Enigmail.
</p>
<p>As configura&ccedil;&otilde;es para criptografar e assinar uma mensagem agora est&atilde;o vis&iacute;veis no canto inferior 
direito da janela de composi&ccedil;&atilde;o de mensagem, com pequenos &iacute;cones sendo mostrados caso a assinatura ou 
criptografia estejam ligadas.
</p>

<h2>Problemas Conhecidos</h2>

<ul>
<li>O Enigmail ainda n&atilde;o &eacute; capaz de lembrar de m&uacute;ltiplas senhas para chaves PGP diferentes. 
&Eacute; necess&aacute;rio digitar a senha todas as vezes, ou configurar a mesma senha para todas as chaves que 
voc&ecirc; estiver utilizando.
</li>
</ul>
</body>
</html>
