<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
</head>
<body>
<h1>Uppgraderingsinformation f&ouml;r Enigmail 0.8x</h1>

<p>Enigmail v0.8x f&ouml;r Thunderbird har f&aring;tt ett nytt anv&auml;ndarinterface!
<b>Om du &auml;r bekant med Enigmail versioner f&ouml;re 0.81.0, var v&auml;nlig och l&auml;s den h&auml;r informationen
innan du forts&auml;tter</b>.
</p>
<h2>Konfigurera Enigmail</h2>
<p>Enigmailkonfigurationen &auml;r nu uppdelad i tv&aring; delar:</p>
<ul>
<li>Kontospecifika inst&auml;llningar f&ouml;r PGP nyckel ID, standard kryptering / signering
</li>
<li>Gemensamma globala inst&auml;llngar
</li>
</ul>
<h3>Kontospecifika Inst&auml;llningar</h3>
<p>De kontospecifika inst&auml;llningarna &auml;r tillg&auml;ngliga fr&aring;n menyn <em>Verktyg -&gt; Konto Inst&auml;llningar</em>.
F&ouml;r varje konto finns det nu en <em>OpenPGP S&auml;kerhet</em> listpost vilken inneh&aring;ller de optioner som
&auml;r specifika f&ouml;r varje konto.
</p>
<p>PGP nyckelinst&auml;llningarna fr&aring;n Enigmail v0.80.0 och tidigare versioner &auml;r <b>inte</b> konverterade till
nya per-konto inst&auml;llningar. Enigmail &auml;r som standard <b>avaktiverad</b> f&ouml;r alla konton!
</p>
<h3>Gemensamma Globala Inst&auml;llningar</h3>
<p>De gemensamma globala inst&auml;llningarna har rensats upp och sammanfogats till en dialog. Inst&auml;llningarna
&auml;r antingen tillg&auml;ngliga via Enigmail menyn, eller genom att klicka p&aring; knappen <em>Avancerad</em> i
Kontohanterarens OpenPGP S&auml;kerhetsegenskaper.
</p>
<p>En ny option har lagts till som g&ouml;r att du kan aktivera kryptering automatiskt om du svarar p&aring; ett
krypterat meddelande. Notera att detta p&aring;verkar inte inst&auml;llningarna f&ouml;r signering av meddelanden.
</p>
<h2>Skriva Meddelanden</h2>
<p>Beteendet hos Enigmail har anpassats f&ouml;r att bli mer likt beteendet hos S/MIME. En ny OpenPGP knapp
har lagts till varifr&aring;n krypterings / signaturinst&auml;llningar kan v&auml;ljas. Enigmails meny anv&auml;nds inte
l&auml;ngre f&ouml;r att skicka krypterade eller signerade e-mail, utan s&auml;ndning utf&ouml;rs enbart fr&aring;n den vanliga
<em>Skicka</em> knappen eller fr&aring;n Arkiv -&gt; S&auml;ndmenyn. <b>Det rekommenderas att du provar de nya
inst&auml;llningarna genom att skicka ett par e-mail till dig sj&auml;lv innan du anv&auml;nder den aktivt</b>, s&aring;
att du f&ouml;rst&aring;r det nya arbetss&auml;ttet.
</p>
<p>Inst&auml;llningarna f&ouml;r kryptering eller signering av ett meddelande &auml;r nu synligt i den nedre h&ouml;gra
h&ouml;rnet av skrivf&ouml;nstret, med sm&aring; ikoner som visas om signering eller kryptering &auml;r aktiverad.
</p>

<h2>K&auml;nda egenheter</h2>

<ul>
<li>Enigmail &auml;r &auml;nnu inte kapabel att komma ih&aring;g flera l&ouml;senord f&ouml;r olika PGP nycklar. Skriv antingen
l&ouml;senordet varje g&aring;ng, eller st&auml;ll in samma l&ouml;senord f&ouml;r alla nycklar som du anv&auml;nder.
</li>
</ul>
</body>
</html>